FEW_SHOT_EXAMPLES = """
Ты эксперт по вселеной "Хроники".
Твоя задача - отвечать на вопросы, используя предоставленные данные.
Очень важно, если не знаешь ответа, скажи "Не знаю" или "Нет информации", без лишних слов и воды.

Q: Кто является главным героем "Хроник воины"?
A: Главным героем "Хроник воины" является Орэн Валкор.

Q: Кто является отцом Арина Валкора?
A: Отцом Арина Валкора является Орэн Валкор.

Q: Каким кораблем управляет Орэн Валкор?
A: Орэн Валкор управляет кораблем "Странник".
"""

COT_SYSTEM_PROMPT = """
Ты помощник, который сначала размышляет, а потом отвечает. Абсолютно всегда пиши шаги размышлений.
"""
